# 切片: 方法适用于 字符串、列表、元组
# 字符串名[开始索引:结束索引:步长]

# 下标索引字符串中的字符
str = "0123456789"
print(str[1])  # 以数组索引方式字符，从0开始


num_str = "0123456789"

# 1. 截取从 2~5 位置 的字符串
print(num_str[2:6])  # 2345

# 2. 截取从 2~末尾 的字符串
print(num_str[2:])  # 23456789

# 3. 截取从 开始~5 位置 的字符串
print(num_str[:6])  # 012345

# 4. 截取完整的字符串
print(num_str[:])  # 0123456789

# 5. 从开始位置，每隔一个字符截取字符串
print(num_str[::2])  # 02468

# 6. 从索引 1 开始，每隔一个取一个
print(num_str[1::2])  # 13579

# 倒序切片
# -1 表示倒数第一个字符
print(num_str[-1])  # 9

# 7. 截取从 2~末尾-1 的字符串 (左闭右开)
print(num_str[2:-1])  # 2345678

# 8. 截取字符串末尾两个字符
print(num_str[-2:])  # 89

# 步长-1,方向选取
print(num_str[-4:-1])  # 678
print(num_str[-4:-1:1])  # 678

# 如果选择方向与下标方向不一致，则无法选取数据
print(num_str[-4:-1:-1])  # 方向不一致
print(num_str[-1:-4:-1])  # 方向一致

# 9. 字符串的逆序
print(num_str[::-1])  # 2345678
